grevaillot/svd_tools/headers/STM32F7x2/rcc.h
#define RCC_DCKCFGR2_I2C2SEL_SHIFT		18
#define RCC_DCKCFGR2_I2C2SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_i2c2sel I2C2SEL I2C2 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_I2C1SEL_SHIFT		16
#define RCC_DCKCFGR2_I2C1SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART8SEL_SHIFT		14
#define RCC_DCKCFGR2_UART8SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart8sel UART8SEL UART 8 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART7SEL_SHIFT		12
#define RCC_DCKCFGR2_UART7SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart7sel UART7SEL UART 7 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART6SEL_SHIFT		10
#define RCC_DCKCFGR2_UART6SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart6sel UART6SEL USART 6 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART5SEL_SHIFT		8
#define RCC_DCKCFGR2_UART5SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart5sel UART5SEL UART 5 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART4SEL_SHIFT		6
#define RCC_DCKCFGR2_UART4SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart4sel UART4SEL UART 4 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART3SEL_SHIFT		4
#define RCC_DCKCFGR2_UART3SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart3sel UART3SEL USART 3 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART2SEL_SHIFT		2
#define RCC_DCKCFGR2_UART2SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart2sel UART2SEL USART 2 clock source selection
@{*/
/**@}*/


#define RCC_DCKCFGR2_UART1SEL_SHIFT		0
#define RCC_DCKCFGR2_UART1SEL_MASK		0x03
/** @defgroup rcc_dckcfgr2_uart1sel UART1SEL USART 1 clock source selection
@{*/
/**@}*/


/**@}*/
